function Vpr=ConvertMToVpr(H,M)
% H - барометрическая высота в метрах; M - число М
% функция перевода числа М в приборную скорость [км/ч]
if length(H)>1 && length(M)>1 
   throw(MException('MyComponent:inputError','оба аргумента не могут быть массивами')); 
end

Hm_Pst=[0, 1000, 2000, 3000, 4000, 5000, 6000, 7000, 8000, 9000, 10000, 11000, 12000, 13000, 14000, 15000, 16000, 17000, 18000, 19000, 20000, 22000, 24000, 26000, 28000, 30000, 35000, 40000, 45000, 50000];
Pstm=[760,   674,   596,   526,   462,   405,   354,   308,   267,   231,     199,     170,     146,     124,     106,    90.8,   77.7,   66.4,   56.7,    48.5,  41.5,    30.4,     22.3,    16.4,    12.1,    8.98,    4.31,    2.15,   1.12,   0.598];
k=13.595*interp1(Hm_Pst,Pstm,H).*((1+0.2*M.^2).^3.5-1);
Vpr=2738.56*sqrt((k/10332.3+1.).^0.286-1);

end