function Vpr=ConvertVistToVpr(H,Vist)
% H - барометрическая высота в метрах; Vist - истинная скорость в м/с
% функция перевода истинной скорости [м/с] в приборную [км/ч]
if length(H)>1 && length(Vist)>1 
   throw(MException('MyComponent:inputError','оба аргумента не могут быть массивами')); 
end

Hm=[0.0 1000. 2000. 3000. 4000. 5000. 6000. 7000. 8000. 9000. 10000. 11000.  25000. 26000. ];
am=[340.3 336.4 332.5 328.6 324.6 320.5 316.4 312.3 308.0 303.8 299.5 295.1 295.1 296.9 ];
M=Vist./interp1(Hm,am,H);
Vpr=ConvertMToVpr(H,M);
end